一、总体规范
1.文件命名：
  使用全小写字母，单词之间用中划线（-）分隔。
  样式文件统一以 .css 结尾，脚本文件以 .js 结尾。
2.目录结构
  按功能模块划分目录。
  所有资源文件放置在对应文件夹下，避免混乱。
3.注释规范
  HTML 注释：<!-- 页面主要部分说明 -->
  CSS 注释：/* 样式说明 */
  JS 注释：
  // 单行注释：说明逻辑或功能点
  /**
   * 多行注释：描述函数作用、参数与返回值
   */
二、HTML 编码规范
  统一使用 UTF-8 编码。
  使用语义化标签，如 <header>, <main>, <footer>，避免滥用 <div>。
  所有标签必须闭合，属性值必须使用双引号。
  图片、超链接等需添加 alt、title 属性，保证可访问性。
三、CSS 编码规范
  采用外部样式表，不建议行内样式。
  选择器命名使用 BEM规范
  属性顺序遵循以下规则：
  布局属性 > 尺寸属性 > 文字属性 > 颜色属性 > 其他属性
  颜色值统一使用十六进制格式（如 #333333），禁止混用简写与RGB格式。
四、JavaScript 编码规范
  使用严格模式：'use strict';  
  变量命名采用 驼峰命名法（camelCase），常量使用全大写：
  函数命名使用动词开头：getData(), renderTable()。
  严格区分 == 与 ===，优先使用 ===。
  避免全局变量污染，推荐使用模块化结构或函数作用域。
五、代码风格
  每行长度不超过 100 个字符。
  使用 2 个空格缩进。
  保持代码块之间适当空行，提高可读性。
